package seminars.seminar2;

// import java.io.FileWriter;

public class task4 {
    int n = 10;
    String text = "TEST";
}
//     try {

    
//     FileWriter writer = new FileWriter("file.txt", false);
// }
// catch (IO)
// }



// Напишите метод, который составит строку, состоящую из 10 повторений слова TEST и метод, 
// который запишет эту строку в простой текстовый файл, обработайте исключения.


// public class Task4 {
//     public static void main(String[] args) {
//         int n = 10;
//         String text = "TEST";
//         try{
//             FileWriter writer = new FileWriter("file.txt",true);
//             System.out.println("Получилось");
//             for (int i = 0; i < n; i++) {
//                 writer.write(text);
//             }
//             writer.close();
//         }
//         catch (IOException e ){
//             System.out.println(e.getMessage());
//         }
//     }
// }